Catalogs/ИА_БПМаршрутЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПМаршрутЗадач</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяКартаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПКартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВладельцаБПВЗадаче</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВладельцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_БПКартыМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПКартыМаршрутов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfCharacteristicTypes/ИА_БПРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ИА_БПРеквизиты</Name>
			<Type>
				<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_ПланыДействий</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_БПДополнительныеЗначенияРеквизитов</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_ПротоколРС</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_ЗакрытиеЗаказаНаПриобретение</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_Определения</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_ФинансовоеПланирование</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_УстановкаКвотыСтатистик</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
				<v8:Type>cfg:DocumentRef.удалить_ИА_НастройкаФП</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_ПроверочныйСписок</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_Статистика</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_Константы</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_СтратегическоеУправление</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_Инструкции</v8:Type>
				<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>20</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецРеквизита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ИА_БПРеквизиты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УниКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Catalogs/ИА_БПМаршрутЗадач/Ext/ManagerModule.bsl
Процедура СоздатьНовуюВерсиюДляМаршрутаЗадач(МаршрутЗадач) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        МаршрутЗадач = Справочники.ИА_БПМаршрутЗадач.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    СпрМЗ = МаршрутЗадач.ПолучитьОбъект();
    
    Если НЕ ЗначениеЗаполнено(МаршрутЗадач.ТекущаяКартаМаршрута) Тогда
        // Создать новую
        Спр = Справочники.ИА_БПКартыМаршрутов.СоздатьЭлемент();
        Спр.МаршрутЗадач = МаршрутЗадач;
    Иначе // Скопировать существующую
        Спр = Справочники.ИА_БПКартыМаршрутов.СоздатьЭлемент();
        Спр.Заполнить(МаршрутЗадач.ТекущаяКартаМаршрута);
    КонецЕсли; 
    Спр.Версия = ПолучитьНовуюВерсию(МаршрутЗадач);
    Спр.Наименование = МаршрутЗадач.Наименование + ", версия " + Спр.Версия;
    Спр.Записать();        
    
    СпрМЗ.ТекущаяКартаМаршрута = Спр.Ссылка;
    СпрМЗ.Записать();
КонецПроцедуры

Функция ПолучитьНовуюВерсию(МаршрутЗадач)
    Запрос = Новый Запрос(
    "ВЫБРАТЬ   разрешенные
    |	МАКСИМУМ(ИА_БПКартыМаршрутов.Версия) КАК Версия
    |ИЗ
    |	Справочник.ИА_БПКартыМаршрутов КАК ИА_БПКартыМаршрутов
    |ГДЕ
    |	ИА_БПКартыМаршрутов.МаршрутЗадач = &МаршрутЗадач");
    Запрос.УстановитьПараметр("МаршрутЗадач", МаршрутЗадач);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() И Выборка.Версия <> NULL Тогда
        ТекущаяВерсия = Выборка.Версия;
    Иначе	
        ТекущаяВерсия = -1;
    КонецЕсли; 
    Возврат ТекущаяВерсия + 1;
КонецФункции

Функция ПолучитьСписокМаршрутовПоОбъекту(Объект) Экспорт
    М = Новый Массив;
    М.Добавить(ТипЗнч(Объект));
    
    ОписаниеТиповОбъекта = Новый ОписаниеТипов(М);
    Таб = ИА_БФС.Типы_ОписаниеТипов2ТаблицаСтроковыхТипов(ОписаниеТиповОбъекта);
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Т.Имя
    |ПОМЕСТИТЬ Таб
    |ИЗ
    |   &ТЗ КАК Т
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ   разрешенные
    |   Т.Ссылка
    |ИЗ
    |   Таб КАК Таб
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИА_БПМаршрутЗадач.ДоступныеВладельцы КАК Т
    |       ПО Таб.Имя = Т.Имя
    |
    |СГРУППИРОВАТЬ ПО
    |   Т.Ссылка";
    Запрос.УстановитьПараметр("ТЗ", Таб);
    Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    Возврат Результат;
КонецФункции

Функция ПолучитьТаблицуДопРеквизитов(МаршрутЗадач) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ   разрешенные
    |	ИА_БПРеквизиты.Ссылка Реквизит,
    |	ИА_БПРеквизиты.Наименование + "" ("" + ИА_БПРеквизиты.УниКод + "")"" КАК Наименование
    |ИЗ
    |	ПланВидовХарактеристик.ИА_БПРеквизиты КАК ИА_БПРеквизиты
    |ГДЕ
    |	ИА_БПРеквизиты.ВладелецРеквизита = &МаршрутЗадач
    |	И НЕ ИА_БПРеквизиты.ЭтоГруппа
    |	И НЕ ИА_БПРеквизиты.ПометкаУдаления";
    Запрос.УстановитьПараметр("МаршрутЗадач", МаршрутЗадач);
    Результат = Запрос.Выполнить().Выгрузить();
    Возврат Результат;
КонецФункции

Функция ЕстьДопРеквизиты(МаршрутЗадач) Экспорт
    Возврат ПолучитьТаблицуДопРеквизитов(МаршрутЗадач).Количество() > 0;
КонецФункции
